---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSkylightWidth(System.Double)
source: html/a224f2e3-ff95-7852-40dc-8875187c397d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSkylightWidth Method

Checks that the skylight width is greater than or equal to eight inches.

## Syntax (C#)
```csharp
public static bool CheckRangeOfSkylightWidth(
	double skylightWidth
)
```

## Parameters
- **skylightWidth** (`System.Double`) - The skylight width to be checked. Should be greater than or equal to eight inches.

## Returns
True if the skylight width is greater than or equal to eight inches, false otherwise.